РП/src/Catalogs/Бригады/Бригады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Бригады</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПрименятьРаспределениеПоКТУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Documents/ФормированиеСоставаБригады/ФормированиеСоставаБригады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеСоставаБригады</name>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НормативныйКТУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РП/src/Catalogs/Бригады/Forms/СоставБригады/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Бригада = Параметры.Бригада;
	
	Дата = КонецДня(ТекущаяДатаСеанса());
	
	ПолучитьСведенияОСоставеНаСервере();

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ПолучитьСведенияОСоставеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НадписьДокументНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Документ) Тогда
		ПоказатьЗначение(Неопределено, Документ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСоздатьНажатие(Элемент)
	
	ЗначенияЗаполнения = Новый Структура();
	ЗначенияЗаполнения.Вставить("Бригада", Бригада);
	ЗначенияЗаполнения.Вставить("НачалоПериода", Дата);
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ФормированиеСоставаБригады.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ПолучитьСведенияОСоставеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьСведенияОСоставеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ФормированиеСоставаБригады.НачалоПериода) КАК Дата
	|ПОМЕСТИТЬ СоставНаДату
	|ИЗ
	|	Документ.ФормированиеСоставаБригады КАК ФормированиеСоставаБригады
	|ГДЕ
	|	ФормированиеСоставаБригады.НачалоПериода <= &Дата
	|	И ФормированиеСоставаБригады.Бригада = &Бригада
	|	И ФормированиеСоставаБригады.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ФормированиеСоставаБригады.НачалоПериода) КАК Дата
	|ПОМЕСТИТЬ СледующийСостав
	|ИЗ
	|	Документ.ФормированиеСоставаБригады КАК ФормированиеСоставаБригады
	|ГДЕ
	|	ФормированиеСоставаБригады.НачалоПериода > &Дата
	|	И ФормированиеСоставаБригады.Бригада = &Бригада
	|	И ФормированиеСоставаБригады.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставНаДату.Дата КАК ДействуетС,
	|	ФормированиеСоставаБригады.Ссылка КАК Документ,
	|	ЕСТЬNULL(СледующийСостав.Дата, 0) КАК ДействуетПо,
	|	ФормированиеСоставаБригады.Номер КАК Номер,
	|	ФормированиеСоставаБригады.Дата КАК Дата
	|ИЗ
	|	СоставНаДату КАК СоставНаДату
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ФормированиеСоставаБригады КАК ФормированиеСоставаБригады
	|		ПО СоставНаДату.Дата = ФормированиеСоставаБригады.НачалоПериода,
	|	СледующийСостав КАК СледующийСостав
	|ГДЕ
	|	ФормированиеСоставаБригады.Бригада = &Бригада
	|	И ФормированиеСоставаБригады.Проведен";
	
	Запрос.УстановитьПараметр("Бригада", Бригада);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	ШаблонОбщейНадписи = НСтр("ru='Действует с %1 по %2.';uk='Діє з %1 по %2.'");
	ШаблонНадписиДокумента = НСтр("ru='Формирование состава №%1 от %2';uk='Формування складу №%1 від %2'");
	
	НадписьОбщая = "";
	Документ = Документы.ФормированиеСоставаБригады.ПустаяСсылка();
	
	Пока Выборка.Следующий() Цикл
		
		Документ = Выборка.Документ;
		
		Номер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Выборка.Номер);
		ДатаДокумента = Формат(Выборка.Дата, "ДЛФ=D");
		ДействуетС = Формат(Выборка.ДействуетС, "ДЛФ=D");
		
		Если ЗначениеЗаполнено(Выборка.ДействуетПо) Тогда
			ДействуетПо = Формат(Выборка.ДействуетПо, "ДЛФ=D");
		Иначе
			ДействуетПо = НСтр("ru='настоящее время';uk='теперішній час'");
		КонецЕсли;
		
		НадписьОбщая = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОбщейНадписи, ДействуетС, ДействуетПо);
		НадписьДокумент = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНадписиДокумента, Номер, ДатаДокумента);
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(НадписьОбщая) Тогда
		
		НадписьОбщая = НСтр("ru='Состав бригады не задан.';uk='Склад бригади не заданий.'");
		
		Элементы.НадписьДокумент.Видимость = Ложь;
	Иначе
		Элементы.НадписьДокумент.Видимость = Истина;
	КонецЕсли;
	
	СотрудникиБригады.Параметры.УстановитьЗначениеПараметра("Ссылка", Документ);
	
КонецПроцедуры

#КонецОбласти
